In [1]:
import pandas as pd

In [4]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("serries \n",series)
print(type(series))

serries
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
# Create series from dict
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [10]:
#Data frame 
# create a Data frame a dictionery of list 
data ={
    'Name': ['krish','john','jack'],
    'age':[25,30,45],
    'city':['Banglore','NewYork','Florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  age      city
0  krish   25  Banglore
1   john   30   NewYork
2   jack   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [11]:
import numpy as np
np.array(df)

array([['krish', 25, 'Banglore'],
       ['john', 30, 'NewYork'],
       ['jack', 45, 'Florida']], dtype=object)

In [61]:
# creat a data frame from list of dict
data =[
    {'Name':'krish','Age':42,'City':'banglore'},
     {'Name':'prathamesh','Age':34,'City':'chakan'},
      {'Name':'pravin','Age':13,'City':'pune'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

         Name  Age      City
0       krish   42  banglore
1  prathamesh   34    chakan
2      pravin   13      pune
<class 'pandas.core.frame.DataFrame'>

In [64]:
df=pd.read_csv('test.csv')
df.head(5)

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%)
0,01-Jul-25,"3,150",38,82.89,3.2,11,27,55,280,"1,500","1,050",600,38
1,02-Jul-25,"4,200",45,93.33,4.1,18,27,42,310,"2,100","1,500",600,40
2,03-Jul-25,"3,800",41,92.68,3.7,15,26,48,295,"1,900","1,300",600,39
3,04-Jul-25,"5,500",60,91.67,5.3,25,35,35,350,"2,800","2,000",700,42

In [36]:
df.tail(5)

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%)
0,01-Jul-25,"3,150",38,82.89,3.2,11,27,55,280,"1,500","1,050",600,38
1,02-Jul-25,"4,200",45,93.33,4.1,18,27,42,310,"2,100","1,500",600,40
2,03-Jul-25,"3,800",41,92.68,3.7,15,26,48,295,"1,900","1,300",600,39
3,04-Jul-25,"5,500",60,91.67,5.3,25,35,35,350,"2,800","2,000",700,42

In [37]:
#accesing data from data frame 
df['Date']

0    01-Jul-25
1    02-Jul-25
2    03-Jul-25
3    04-Jul-25
Name: Date, dtype: object

In [26]:
df.loc[0][6]

C:\Users\prathamesh kolhe\AppData\Local\Temp\ipykernel_19920\3333638368.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][6]

'27'

In [25]:
df.iloc[0][6]

C:\Users\prathamesh kolhe\AppData\Local\Temp\ipykernel_19920\1424552850.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][6]

'27'

In [28]:
## accesing a specified elemnt
df.at[23,'Date']

'24-Jul-25'

In [30]:
# Accesing spoecified element using iat 
df.iat[2,2]

'41'

In [ ]:
# Data manupilation with df

In [53]:
# Adding a Column
df['Salary']=[2345,2455,6264,646]
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),Salary
0,01-Jul-25,"3,150",38,82.89,3.2,11,27,55,280,"1,500","1,050",600,38,2345
1,02-Jul-25,"4,200",45,93.33,4.1,18,27,42,310,"2,100","1,500",600,40,2455
2,03-Jul-25,"3,800",41,92.68,3.7,15,26,48,295,"1,900","1,300",600,39,6264
3,04-Jul-25,"5,500",60,91.67,5.3,25,35,35,350,"2,800","2,000",700,42,646

In [ ]:
# Remoe a column 
df.drop('Salary',axis=1,inplace=True)
# inplace=true means it permently modified

In [54]:
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),Salary
0,01-Jul-25,"3,150",38,82.89,3.2,11,27,55,280,"1,500","1,050",600,38,2345
1,02-Jul-25,"4,200",45,93.33,4.1,18,27,42,310,"2,100","1,500",600,40,2455
2,03-Jul-25,"3,800",41,92.68,3.7,15,26,48,295,"1,900","1,300",600,39,6264
3,04-Jul-25,"5,500",60,91.67,5.3,25,35,35,350,"2,800","2,000",700,42,646

In [56]:
# modified total sales
df['Salary']=df['Salary']+1000
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),Salary
0,01-Jul-25,"3,150",38,82.89,3.2,11,27,55,280,"1,500","1,050",600,38,3345
1,02-Jul-25,"4,200",45,93.33,4.1,18,27,42,310,"2,100","1,500",600,40,3455
2,03-Jul-25,"3,800",41,92.68,3.7,15,26,48,295,"1,900","1,300",600,39,7264
3,04-Jul-25,"5,500",60,91.67,5.3,25,35,35,350,"2,800","2,000",700,42,1646

In [65]:
df.drop(0,inplace=True)

In [66]:
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%)
1,02-Jul-25,"4,200",45,93.33,4.1,18,27,42,310,"2,100","1,500",600,40
2,03-Jul-25,"3,800",41,92.68,3.7,15,26,48,295,"1,900","1,300",600,39
3,04-Jul-25,"5,500",60,91.67,5.3,25,35,35,350,"2,800","2,000",700,42